 01000 IDENTIFICATION DIVISION.
 01100 PROGRAM-ID. hello-world.

 02000 ENVIRONMENT DIVISION.
 02100 CONFIGURATION SECTION.

 03000 DATA DIVISION.

 04000 PROCEDURE DIVISION.
           DISPLAY "Hello, world!"
           .
